tutorials/multiphase/stirringInterPTFoam/laminar/stirringCulture/constant/kinematicCloudPositions

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.0.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.000970 0.000957 0.000952)
(0.000975 0.000972 0.001905)
(0.000984 0.000954 0.002838)
(0.000996 0.000954 0.003789)
(0.000976 0.000955 0.004734)
(0.000999 0.000972 0.005676)
(0.000971 0.000956 0.006614)
(0.000978 0.000962 0.007560)
(0.001001 0.000954 0.008503)
(0.000983 0.000964 0.009456)
(0.000990 0.000967 0.010397)
(0.000970 0.000969 0.011335)
(0.000985 0.000957 0.012290)
(0.000996 0.000968 0.013238)
(0.000993 0.000958 0.014172)
(0.000995 0.000964 0.015123)
(0.000997 0.000970 0.016056)
(0.000999 0.001907 0.000959)
(0.000986 0.001919 0.001899)
(0.000971 0.001910 0.002835)
(0.000971 0.001907 0.003779)
(0.000989 0.001913 0.004728)
(0.000996 0.001923 0.005670)
(0.000994 0.001908 0.006614)
(0.000971 0.001907 0.007562)
(0.000996 0.001910 0.008508)
(0.000972 0.001906 0.009449)
(0.000988 0.001918 0.010399)
(0.000990 0.001912 0.011348)
(0.001001 0.001922 0.012294)
(0.000999 0.001920 0.013239)
(0.000988 0.001923 0.014182)
(0.000988 0.001920 0.015113)
(0.000983 0.001919 0.016067)
(0.001000 0.002876 0.000952)
(0.000992 0.002862 0.001900)
(0.000991 0.002861 0.002847)
(0.000982 0.002866 0.003788)
(0.000987 0.002859 0.004725)
(0.000971 0.002868 0.005680)
(0.000996 0.002877 0.006624)
(0.000993 0.002867 0.007566)
(0.000984 0.002861 0.008516)
(0.000972 0.002873 0.009457)
(0.000986 0.002875 0.010404)
(0.000979 0.002876 0.011334)
(0.000983 0.002864 0.012292)
(0.000982 0.002870 0.013232)
(0.000979 0.002870 0.014180)
(0.000976 0.002861 0.015128)
(0.000971 0.002875 0.016067)
(0.000971 0.003817 0.000960)
(0.000972 0.003813 0.001891)
(0.000971 0.003826 0.002840)
(0.000978 0.003823 0.003784)
(0.000974 0.003811 0.004725)
(0.000978 0.003810 0.005668)
(0.000977 0.003822 0.006622)
(0.000978 0.003813 0.007560)
(0.000976 0.003811 0.008505)
(0.000978 0.003822 0.009450)
(0.000991 0.003813 0.010401)
(0.000985 0.003818 0.011337)
(0.000995 0.003814 0.012289)
(0.000979 0.003820 0.013233)
(0.000975 0.003810 0.014182)
(0.000998 0.003823 0.015113)
(0.000973 0.003819 0.016068)
(0.000980 0.004764 0.000953)
(0.000977 0.004771 0.001895)
(0.000989 0.004777 0.002843)
(0.000997 0.004766 0.003790)
(0.000998 0.004768 0.004732)
(0.000992 0.004779 0.005680)
(0.000976 0.004777 0.006613)
(0.000983 0.004779 0.007566)
(0.000990 0.004781 0.008504)
(0.000998 0.004774 0.009448)
(0.000985 0.004766 0.010405)
(0.000993 0.004768 0.011334)
(0.000986 0.004766 0.012284)
(0.000984 0.004780 0.013229)
(0.001001 0.004774 0.014174)
(0.000978 0.004777 0.015114)
(0.000984 0.004763 0.016071)
(0.000972 0.005720 0.000958)
(0.000994 0.005734 0.001898)
(0.000982 0.005723 0.002835)
(0.001000 0.005715 0.003779)
(0.000987 0.005733 0.004723)
(0.000992 0.005726 0.005671)
(0.000990 0.005734 0.006625)
(0.001000 0.005723 0.007556)
(0.000972 0.005730 0.008513)
(0.000996 0.005727 0.009461)
(0.001001 0.005720 0.010389)
(0.000999 0.005725 0.011338)
(0.000973 0.005727 0.012280)
(0.000991 0.005715 0.013237)
...
)

// ************************************************************************* //
